{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "name": "input_0", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "560_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "560_pad", "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "560", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "560", "inbound_nodes": [[["560_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "303", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "303", "inbound_nodes": [[["560", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "563_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "563_pad", "inbound_nodes": [[["303", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "563", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "563", "inbound_nodes": [[["563_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "306", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "306", "inbound_nodes": [[["563", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "566", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "566", "inbound_nodes": [[["306", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "309", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "309", "inbound_nodes": [[["566", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "569_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "569_pad", "inbound_nodes": [[["309", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "569", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "569", "inbound_nodes": [[["569_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "312", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "312", "inbound_nodes": [[["569", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "572", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "572", "inbound_nodes": [[["312", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "315", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "315", "inbound_nodes": [[["572", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "575_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "575_pad", "inbound_nodes": [[["315", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "575", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "575", "inbound_nodes": [[["575_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "318", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "318", "inbound_nodes": [[["575", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "578", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "578", "inbound_nodes": [[["318", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "321", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "321", "inbound_nodes": [[["578", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "581_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "581_pad", "inbound_nodes": [[["321", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "581", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "581", "inbound_nodes": [[["581_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "324", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "324", "inbound_nodes": [[["581", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "584", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "584", "inbound_nodes": [[["324", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "327", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "327", "inbound_nodes": [[["584", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "587_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "587_pad", "inbound_nodes": [[["327", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "587", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "587", "inbound_nodes": [[["587_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "330", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "330", "inbound_nodes": [[["587", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "590", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "590", "inbound_nodes": [[["330", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "333", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "333", "inbound_nodes": [[["590", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "593_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "593_pad", "inbound_nodes": [[["333", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "593", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "593", "inbound_nodes": [[["593_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "336", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "336", "inbound_nodes": [[["593", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "596", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "596", "inbound_nodes": [[["336", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "339", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "339", "inbound_nodes": [[["596", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "599_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "599_pad", "inbound_nodes": [[["339", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "599", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "599", "inbound_nodes": [[["599_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "342", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "342", "inbound_nodes": [[["599", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "602", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "602", "inbound_nodes": [[["342", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "345", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "345", "inbound_nodes": [[["602", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "605_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "605_pad", "inbound_nodes": [[["345", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "605", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "605", "inbound_nodes": [[["605_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "348", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "348", "inbound_nodes": [[["605", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "608", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "608", "inbound_nodes": [[["348", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "351", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "351", "inbound_nodes": [[["608", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "611_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "611_pad", "inbound_nodes": [[["351", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "611", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "611", "inbound_nodes": [[["611_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "354", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "354", "inbound_nodes": [[["611", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "614", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "614", "inbound_nodes": [[["354", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "357", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "357", "inbound_nodes": [[["614", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "617_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "617_pad", "inbound_nodes": [[["357", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "617", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "617", "inbound_nodes": [[["617_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "360", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "360", "inbound_nodes": [[["617", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "620", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "620", "inbound_nodes": [[["360", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "363", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "363", "inbound_nodes": [[["620", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "623_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "623_pad", "inbound_nodes": [[["363", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "623", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "623", "inbound_nodes": [[["623_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "366", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "366", "inbound_nodes": [[["623", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "626", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "626", "inbound_nodes": [[["366", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "369", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "369", "inbound_nodes": [[["626", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "629_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "629_pad", "inbound_nodes": [[["369", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "629", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "629", "inbound_nodes": [[["629_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "372", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "372", "inbound_nodes": [[["629", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "632", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "632", "inbound_nodes": [[["372", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "375", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "375", "inbound_nodes": [[["632", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "635_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "635_pad", "inbound_nodes": [[["375", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "635", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "635", "inbound_nodes": [[["635_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "378", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "378", "inbound_nodes": [[["635", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "638", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "638", "inbound_nodes": [[["378", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "381", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "381", "inbound_nodes": [[["638", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "647", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "647", "inbound_nodes": [[["381", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "644", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "644", "inbound_nodes": [[["369", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "390", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "390", "inbound_nodes": [[["647", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "387", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "387", "inbound_nodes": [[["644", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "394", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "name": "394", "inbound_nodes": [[["390", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "395", "trainable": true, "dtype": "float32"}, "name": "395", "inbound_nodes": [[["387", 0, 0, {}], ["394", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "650_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "650_pad", "inbound_nodes": [[["395", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "650", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "650", "inbound_nodes": [[["650_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "641", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "641", "inbound_nodes": [[["333", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "398", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "398", "inbound_nodes": [[["650", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "384", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "384", "inbound_nodes": [[["641", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "402", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_first", "interpolation": "nearest"}, "name": "402", "inbound_nodes": [[["398", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "403", "trainable": true, "dtype": "float32"}, "name": "403", "inbound_nodes": [[["384", 0, 0, {}], ["402", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "653_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "653_pad", "inbound_nodes": [[["403", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "653", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "653", "inbound_nodes": [[["653_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "406", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "406", "inbound_nodes": [[["653", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "659_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "659_pad", "inbound_nodes": [[["406", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "674_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "674_pad", "inbound_nodes": [[["398", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "689_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "689_pad", "inbound_nodes": [[["390", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "659", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "659", "inbound_nodes": [[["659_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "674", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "674", "inbound_nodes": [[["674_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "689", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "689", "inbound_nodes": [[["689_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "411", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "411", "inbound_nodes": [[["659", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "425", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "425", "inbound_nodes": [[["674", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "439", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "439", "inbound_nodes": [[["689", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "665_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "665_pad", "inbound_nodes": [[["411", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "680_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "680_pad", "inbound_nodes": [[["425", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "695_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "695_pad", "inbound_nodes": [[["439", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "665", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "665", "inbound_nodes": [[["665_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "680", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "680", "inbound_nodes": [[["680_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "695", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "695", "inbound_nodes": [[["695_pad", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "416", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "416", "inbound_nodes": [[["665", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "430", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "430", "inbound_nodes": [[["680", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "444", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "444", "inbound_nodes": [[["695", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "656_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "656_pad", "inbound_nodes": [[["406", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "662_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "662_pad", "inbound_nodes": [[["411", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "668_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "668_pad", "inbound_nodes": [[["416", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "671_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "671_pad", "inbound_nodes": [[["398", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "677_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "677_pad", "inbound_nodes": [[["425", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "683_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "683_pad", "inbound_nodes": [[["430", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "686_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "686_pad", "inbound_nodes": [[["390", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "692_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "692_pad", "inbound_nodes": [[["439", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "698_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "698_pad", "inbound_nodes": [[["444", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "656", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "656", "inbound_nodes": [[["656_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "662", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "662", "inbound_nodes": [[["662_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "668", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "668", "inbound_nodes": [[["668_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "671", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "671", "inbound_nodes": [[["671_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "677", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "677", "inbound_nodes": [[["677_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "683", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "683", "inbound_nodes": [[["683_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "686", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "686", "inbound_nodes": [[["686_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "692", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "692", "inbound_nodes": [[["692_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "698", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "698", "inbound_nodes": [[["698_pad", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "419", "trainable": true, "dtype": "float32", "axis": 1}, "name": "419", "inbound_nodes": [[["656", 0, 0, {}], ["662", 0, 0, {}], ["668", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "433", "trainable": true, "dtype": "float32", "axis": 1}, "name": "433", "inbound_nodes": [[["671", 0, 0, {}], ["677", 0, 0, {}], ["683", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "447", "trainable": true, "dtype": "float32", "axis": 1}, "name": "447", "inbound_nodes": [[["686", 0, 0, {}], ["692", 0, 0, {}], ["698", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "420", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "420", "inbound_nodes": [[["419", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "434", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "434", "inbound_nodes": [[["433", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "448", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "448", "inbound_nodes": [[["447", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "449", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "449", "inbound_nodes": [[["420", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "461", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "461", "inbound_nodes": [[["434", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "473", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "473", "inbound_nodes": [[["448", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "486", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "486", "inbound_nodes": [[["420", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "498", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "498", "inbound_nodes": [[["434", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "510", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "510", "inbound_nodes": [[["448", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "523", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "523", "inbound_nodes": [[["420", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "535", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "535", "inbound_nodes": [[["434", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "547", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": 